yedouuu/W20_Mainboard/Vendor/EIDE/.pack/ArteryTek/AT32F403A_407_DFP.2.2.0/ArteryTek.AT32F403A_407_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ArteryTek</vendor>
  <url></url>
  <name>AT32F403A_407_DFP</name>
  <description>ArteryTek AT32F403A_407 Series Device Support,Drivers</description>
  <releases>
    <release version="2.2.0" date="2024-08-09">
      Update firmware library.
    </release>
    <release version="2.1.9" date="2024-04-03">
      Update for SFR file.
    </release>
    <release version="2.1.8" date="2024-01-26">
      Update firmware library.
    </release>
    <release version="2.1.7" date="2024-01-05">
      Update firmware library.
    </release>
    <release version="2.1.6" date="2023-10-26">
      Update firmware library.
    </release>
    <release version="2.1.5" date="2023-08-04">
      Update firmware library and svd file.
    </release>
    <release version="2.1.4" date="2023-02-16">
      Update firmware library.
    </release>
    <release version="2.1.3" date="2022-11-18">
      Update firmware library.
    </release>
    <release version="2.1.2" date="2022-08-23">
      Update firmware library.
    </release>
    <release version="2.1.1" date="2022-07-22">
      Update firmware library.
    </release>
    <release version="2.1.0" date="2022-06-29">
      Update firmware library and flm file.
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>ArteryTek</keyword>
    <keyword>AT32F403A</keyword>
    <keyword>AT32F407</keyword>
    <keyword>AT32F4</keyword>
  </keywords>

  <devices>
    <!-- ******************************  Cortex-M4  ********************** -->
    <family Dfamily="AT32F40x Series" Dvendor="ArteryTek:143">
      <!--book name="Device/ARM/Documents/??_dgug.pdf"       title="?? Device Generic Users Guide"/-->
    <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dtz="NO_TZ" Dendian="Little-endian" />
    <compile header="Device/Include/at32f403a_407.h"/>

      <description>
AT32F4 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M4 RISC core,which targeted at various MCU application areas.
AT32F4 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
      </description>

      <!-- ************************  Subfamily 'AT32F403A'  **************************** -->
      <subFamily DsubFamily="AT32F403A">
      <processor  Dfpu="1" Dclock="240000000"/>
      <debug svd="SVD/AT32F403Axx_v2.svd"/>
      <description>
AT32F403A - ARM Cortex-M4 Core
  Frequency up to 240 MHz
  Flash access zero wait state
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 68 external interrupts, each has 16 priority levels

Memories
  Flash size from 256KB up to 1024 KB
  SRAM size up to 224KB

Low power management
  Power saving mode: sleep,deep-sleep and standby mode
  Independent battery supply for RTC and battry powered domain register

Advanced analog peripherals
  Up to 3 x 12bit ADC

Integrated peripherals interface
  Up to 8 x USART/UART/Irda/LIN/ISO7816
  Up to 4 x SPI
  Up to 3 x I2C

On-chip resources
  Up to 2 x 16 bit Advanced Timer, 1 x SysTick Timer, 10 x 16 bit GPTM, 2 x 32 bit GPTM, 2 x WDT, 1 x RTC
  7-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HICK (8MHz), LICK (40KHz)
      </description>

      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="ADC"           n="3"       m="12"/>
      <feature type="Temp"          n="-40"     m="105"/>
      <feature type="VCC"           n="2.60"    m="3.60"/>

        <!-- *************************  Device 'AT32F403ACCT7'  ***************************** -->
        <device Dname="-AT32F403ACCT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403ACCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x40000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_256.FLM"                      start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ACCU7'  ***************************** -->
        <device Dname="-AT32F403ACCU7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403ACCU7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x40000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_256.FLM"                      start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ACET7'  ***************************** -->
        <device Dname="-AT32F403ACET7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403ACET7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x80000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_512.FLM"                      start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ACEU7'  ***************************** -->
        <device Dname="-AT32F403ACEU7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403ACEU7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x80000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_512.FLM"                      start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ACGT7'  ***************************** -->
        <device Dname="-AT32F403ACGT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403ACGT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x100000"    startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_1024.FLM"                     start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ACGU7'  ***************************** -->
        <device Dname="-AT32F403ACGU7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403ACGU7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x100000"    startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_1024.FLM"                     start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ARCT7'  ***************************** -->
        <device Dname="-AT32F403ARCT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403ARCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x40000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_256.FLM"                      start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

