yedouuu/W20_Mainboard/Vendor/EIDE/.pack/ArteryTek/AT32F403A_407_DFP.2.2.0/ArteryTek.AT32F403A_407_DFP.pdsc
        <!-- *************************  Device 'AT32F403ARET7'  ***************************** -->
        <device Dname="-AT32F403ARET7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403ARET7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x80000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_512.FLM"                      start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ARGT7'  ***************************** -->
        <device Dname="-AT32F403ARGT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403ARGT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x100000"    startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_1024.FLM"                     start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403AVCT7'  ***************************** -->
        <device Dname="-AT32F403AVCT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403AVCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x40000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_256.FLM"                      start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403AVET7'  ***************************** -->
        <device Dname="-AT32F403AVET7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403AVET7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x80000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_512.FLM"                      start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403AVGT7'  ***************************** -->
        <device Dname="-AT32F403AVGT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F403AVGT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x100000"    startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_1024.FLM"                     start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403A_USD.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

     </subFamily>

