yedouuu/W20_Mainboard/Vendor/EIDE/.pack/ArteryTek/AT32F403A_407_DFP.2.2.0/ArteryTek.AT32F403A_407_DFP.pdsc
      <!-- ************************  Subfamily 'AT32F407'  **************************** -->
      <subFamily DsubFamily="AT32F407">
      <processor  Dfpu="1" Dclock="240000000"/>
      <debug svd="SVD/AT32F407xx_v2.svd"/>
      <description>
AT32F407 - ARM Cortex-M4 Core
  Frequency up to 240 MHz
  Flash access zero wait state
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 68 external interrupts, each has 16 priority levels

Memories
  Flash size from 256KB up to 1024 KB
  SRAM size up to 224KB

Low power management
  Power saving mode: sleep,deep-sleep and standby mode
  Independent battery supply for real-calendar RTC and battry powered domain register

Advanced analog peripherals
  Up to 3 x 12bit ADC

Integrated peripherals interface
  Up to 8 x USART/UART/Irda/LIN/ISO7816
  Up to 4 x SPI
  Up to 3 x I2C

On-chip resources
  Up to 2 x 16 bit Advanced Timer, 1 x SysTick Timer, 10 x 16 bit GPTM, 2 x 32 bit GPTM, 2 x WDT, 1 x RTC
  5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HICK (8MHz), LICK (40KHz)
      </description>

      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="ADC"           n="1"       m="12"/>
      <feature type="Temp"          n="-40"     m="105"/>
      <feature type="VCC"           n="2.60"    m="3.60"/>

        <!-- *************************  Device 'AT32F407RCT7'  ***************************** -->
        <device Dname="-AT32F407RCT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F407RCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"         size="0x40000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"         size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F407_256.FLM"                         start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F407_USD.FLM"                         start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F407RET7'  ***************************** -->
        <device Dname="-AT32F407RET7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F407RET7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"         size="0x80000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"         size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F407_512.FLM"                         start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F407_USD.FLM"                         start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F407RGT7'  ***************************** -->
        <device Dname="-AT32F407RGT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F407RGT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"         size="0x100000"    startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"         size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F407_1024.FLM"                        start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F407_USD.FLM"                         start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F407VCT7'  ***************************** -->
        <device Dname="-AT32F407VCT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F407VCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"         size="0x40000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"         size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F407_256.FLM"                         start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F407_USD.FLM"                         start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F407VET7'  ***************************** -->
        <device Dname="-AT32F407VET7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F407VET7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"         size="0x80000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"         size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F407_512.FLM"                         start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F407_USD.FLM"                         start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F407VGT7'  ***************************** -->
        <device Dname="-AT32F407VGT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F407VGT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"         size="0x100000"    startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"         size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F407_1024.FLM"                        start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F407_USD.FLM"                         start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F407AVCT7'  ***************************** -->
        <device Dname="-AT32F407AVCT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F407AVCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"         size="0x40000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"         size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F407_256.FLM"                         start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F407_USD.FLM"                         start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F407AVGT7'  ***************************** -->
        <device Dname="-AT32F407AVGT7">
          <compile header="Device/Include/at32f403a_407.h"  define="AT32F407AVGT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"         size="0x100000"    startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"         size="0x18000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F407_1024.FLM"                        start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F407_USD.FLM"                         start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE1_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP0_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F407_EXT_TYPE2_REAMP1_GENERAL.FLM"    start="0x08400000" size="0x1000000" default="0"/>
        </device>

     </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="AT32F403Axx">
      <description>ArteryTek AT32F403A Devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F403A*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <condition id="AT32F407xx">
      <description>ArteryTek AT32F407 Devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F407*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <condition id="AT32F403A_407">
      <description>ArteryTek AT32F403A_407 Devices</description>
      <accept condition="AT32F403Axx"/>
      <accept condition="AT32F407xx"/>
    </condition>

    <condition id="AT32F403Axx ARMCC">
      <description>ArteryTek AT32F403Axx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F403A*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="AT32F407xx ARMCC">
      <description>ArteryTek AT32F407xx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F407*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="AT32F403A_407 CMSIS">
      <description>ArteryTek AT32F403A_407 Devices and CMSIS-CORE</description>
      <require condition="AT32F403A_407"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="at32f403a_407_conf"/>    
      <require Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="crm"/>           
    </condition>

    <!-- AT32F403A_407 STDPERIPHERALS CRM Conditions -->
    <condition id="AT32F403A_407 STDPERIPHERALS CRM">
      <description>ArteryTek AT32F403A_407 Standard Peripherals Drivers with CRM</description>
      <require condition="AT32F403A_407 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="crm"/>
    </condition>

     <!-- AT32F403A_407 STDPERIPHERALS MISC Conditions -->
    <condition id="AT32F403A_407 STDPERIPHERALS MISC">
      <description>ArteryTek  AT32F403A_407 Standard Peripherals Drivers with MISC</description>
      <require condition="AT32F403A_407 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="misc"/>
    </condition>

     <!-- AT32F403A_407 STDPERIPHERALS EVAL Conditions -->
    <condition id="AT32F403A_407 STDPERIPHERALS EVB">
      <description>ArteryTek AT32F403A_407 Standard Peripherals Drivers with EVB</description>
      <require condition="AT32F403A_407 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="gpio"/>
      <require Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="exint"/>
      <require Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="usart"/>
    </condition>
