yedouuu/W20_Mainboard/Vendor/EIDE/.pack/ArteryTek/AT32F403A_407_DFP.2.2.0/ArteryTek.AT32F403A_407_DFP.pdsc
  </conditions>

  <components>
  <!-- at32f403a_407_firmware_library -->
    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="acc" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Auto Clock Calibration (ACC) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ACC
        </RTE_Components_h>
        <files>
          <!-- ACC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_acc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_acc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="adc" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Analog-to-digital converter (ADC) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_adc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="bpr" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Battery Powered Register (BPR) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BPR
        </RTE_Components_h>
        <files>
          <!-- BPR file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_bpr.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_bpr.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="can" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>CAN (CAN) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_can.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_can.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="crc" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Cyclic Redundancy Check (CRC) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_crc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="crm" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS MISC">
      <description>Clock and Reset Management (CRM) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRM
        </RTE_Components_h>
        <files>
          <!-- CRM file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_crm.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_crm.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="dac" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Digital-to-Analog-to converter (DAC) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRM
        </RTE_Components_h>
        <files>
          <!-- DAC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_dac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_dac.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="debug" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Debug (DEBUG) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DEBUG
        </RTE_Components_h>
        <files>
          <!-- DEBUG file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_debug.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_debug.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="dma" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Direct Memory Access (DMA) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_dma.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="emac" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Ethernet MAC (EMAC) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EMAC
        </RTE_Components_h>
        <files>
          <!-- EMAC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_emac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_emac.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="exint" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>External Interrupt/Event (EXINT) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXINT
        </RTE_Components_h>
        <files>
          <!-- EXINT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_exint.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_exint.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="flash" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Flash Memory Controller (FLASH) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FLASH
        </RTE_Components_h>
        <files>
          <!-- FLASH file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_flash.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_flash.c" attr="config" version="2.0.0" />
        </files>
    </component>

