yedouuu/W20_Mainboard/Vendor/EIDE/.pack/ArteryTek/AT32F403A_407_DFP.2.2.0/ArteryTek.AT32F403A_407_DFP.pdsc
    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="gpio" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_gpio.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="i2c" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Inter-integrated Circuit (I2C) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_i2c.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="misc" Cversion="2.0.0" condition="AT32F403A_407 CMSIS">
      <description>MISC driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_misc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="pwc" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Power Control Unit(PWC) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PWC
        </RTE_Components_h>
        <files>
          <!-- PWC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_pwc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_pwc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="rtc" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Real-time Clock (RTC) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_rtc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="sdio" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>SD/SDIO MMC card host interface (SDIO) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_sdio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_sdio.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="spi" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_spi.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="tmr" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>TIMER driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TMR
        </RTE_Components_h>
        <files>
          <!-- TTMER file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_tmr.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_tmr.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="usart" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_usart.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="usb" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Universal Serial Bus driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USB
        </RTE_Components_h>
        <files>
          <!-- USB file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_usb.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_usb.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="wdt" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>watchdog timer(WDT) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WDT
        </RTE_Components_h>
        <files>
          <!-- WDT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_wdt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_wdt.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="wwdt" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>Window Watchdog Timer (WWDT) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDT
        </RTE_Components_h>
        <files>
          <!-- WWDT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_wwdt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_wwdt.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f403a_407_firmware_library" Csub="xmc" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS CRM">
      <description>External Memory Controller (XMC) driver for AT32F403A_407 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_XMC
        </RTE_Components_h>
        <files>
          <!-- XMC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f403a_407_xmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f403a_407_xmc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <!-- Utilities AT32F403A_407 -->
    <component Cclass="Device" Cgroup="evb" Csub="at-start-f403a-407" Cversion="2.0.0" condition="AT32F403A_407 STDPERIPHERALS EVB">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/at32f403a_407_board.h" />
        <!-- evb file -->
        <file category="source" name="Device/Utilities/at32f403a_407_board.c" attr="config" version="2.0.0"/>
      </files>
    </component>

    <!-- Config AT32F403A_407 -->
    <component Cclass="Device" Cgroup="at32f403a_407_conf" Cversion="2.0.0" condition="AT32F403A_407 CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/at32f403a_407_conf.h" attr="config" version="2.0.0"/>
      </files>
    </component>

   <!-- Startup AT32F403A_407  -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="2.0.0" condition="AT32F403A_407">
      <description>System Startup for ArteryTek AT32F403A_407  Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/at32f403a_407.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_at32f403a_407.s" attr="config" version="2.0.0" condition="AT32F403Axx ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_at32f403a_407.s" attr="config" version="2.0.0" condition="AT32F407xx ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_at32f403a_407.c"      attr="config" version="2.0.0"/>
      </files>
    </component>
  </components>
</package>
